export const SCIENTIFIC = [
  '121 Інженерія програмного забезпечення інформаційних систем',
  '121 Інженерія програмного забезпечення комп’ютерних систем',
  '123 Комп’ютерні системи та мережі',
  '126 Інформаційні управляючі системи та технології',
];

export const PROFESSIONAL = [
  '121 Інженерія програмного забезпечення інформаційних систем',
  '121 Інженерія програмного забезпечення комп’ютерних систем',
  '123 Комп’ютерні системи та мережі',
  '126 Інформаційні управляючі системи та технології',
  '126 Інтегровані інформаційні системи',
  '126 Інформаційне забезпечення робототехнічних систем',
];

export const EducationProgramLabels = {
  'Інженерія програмного забезпечення інформаційних систем': 'CSSE',
  "Інженерія програмного забезпечення комп'ютерних систем": 'ISSE',
  'Інтегровані інформаційні системи': 'IIS',
  'Інформаційне забезпечення робототехнічних систем': 'ISRS',
  'Інформаційні управляючі системи та технології': 'IMST',
};
export const EducationProgramAbbreviation = {
    'CSSE':'Інженерія програмного забезпечення інформаційних систем' ,
    'ISSE': "Інженерія програмного забезпечення комп'ютерних систем",
     'IIS':'Інтегровані інформаційні системи',
     'ISRS':'Інформаційне забезпечення робототехнічних систем',
     'IMST':'Інформаційні управляючі системи та технології',
};


export const specialities = {
  '123': 'Комп’ютерна інженерія',
  '121': 'Інженерія програмного забезпечення',
  '126': 'Інформаційні системи та технології',
};
