import { QueueErorr } from '../types/QueueTypes';

export const QueueErrorMessages: { [key: string]: string } = {
  [QueueErorr.NO_PERMISSION]:
    'Ви відмовили у доступі до геолокації. Будь ласка, дозвольте доступ до геолокації у налаштуваннях браузера та спробуйте знову.',
  [QueueErorr.NOT_NEARBY]:
    'На жаль, ви не можете увійти в чергу, оскільки знаходитеся більш ніж 2 км від міця реєстрації. Підійдіть ближче до місця реєстрації та спробуйте знову!',
  [QueueErorr.CLOSED]:
    'На жаль, ви не можете увійти в чергу, оскільки вона зараз закрита. Будь ласка, спробуйте пізніше.',
  [QueueErorr.ALREADY_IN_QUEUE]:
    'Ви вже перебуваєте у черзі. Будь ласка, дочекайтеся своєї черги або спробуйте перезавантажити сторінку, щоб побачити свій номер.',
  generic: 'Сталася помилка. Будь ласка, спробуйте знову пізніше.',
};
